Autodesk.Revit.UI.RadioButtonGroupData.#ctor(System.String)
Constructs a new instance of RadioButtonGroupData.
name: The internal name of the RadioButtonGroup.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when null is passed for name.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when an empty string is passed for name.
Since: 2011

Autodesk.Revit.UI.RadioButtonGroupData
This class contains information necessary to construct a ribbon gallery in the Ribbon.
Since: 2011